app/controllers/twitter_controller.rb

SELECT `queries`.id FROM `queries` WHERE (`queries`.`lang` = 'la' AND `queries`.`q` = 'q' AND `queries`.`from_user` = 'from') LIMIT 1
INSERT INTO `queries` (`created_at`, `from_user`, `updated_at`, `q`, `lang`, `rpp`, `since`) VALUES('2010-03-24 15:34:59', 'from', '2010-03-24 15:34:59', 'q', 'la', 1, NULL)
---
  def search
    if request.xhr?
      ## Instantiates a new Query object
      query = Query.new(params[:query])

      ## Workaround
      # When creating a new Query object by passing the ajax parameters, the
      # empty parameters should be considered nil
      query.from_user = nil if query.from_user == ''
      query.lang = nil if query.lang == ''
      query.q = nil if query.q == ''

      #puts query.inspect

      ## Query object validation
      if not query.valid?
        respond_to do |format|
          format.html
          format.js do
            render :update do |page|
              flash.now[:error] = query.errors.full_messages
              page.replace_html('results', :partial => 'error')
            end
          end
        end

      ## Verify Query object existance
      else
        sql = "select * from queries where "

        if not query.q.nil? and not query.q.empty?
          sql << "q='" + query.q + "' "

UPDATE `queries` SET `updated_at` = '2010-03-24 23:00:59' WHERE `id` = 11
SELECT `queries`.id FROM `queries` WHERE (`queries`.`id` = 1) LIMIT 1
---
          #puts @tweets.inspect

          ## Workaround: as the 'updated_at' is not being automatically
          # updated. Update forced.
          query.updated_at = Time.now
          query.save.to_s

          @queries = Query.find(:all, :order => 'updated_at DESC', :limit => 7)